examples/08_equipment/src/Documents/ПеремещениеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МестонахождениеОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаУстановки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаУстановки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

examples/08_equipment/src/InformationRegisters/МестонахождениеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОборудования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаУстановки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

examples/08_equipment/src/Documents/ПеремещениеОборудования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Местонахождение оборудования
	Движения.МестонахождениеОборудования.Записывать = Истина;
	Движение = Движения.МестонахождениеОборудования.Добавить();
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.МестоУстановки = МестоОтправитель;
	Движение.Ответственный = НовыйОтветственный;
	Движение.Количество = 1;

	// Движения по регистру Местонахождение оборудования
	Движения.МестонахождениеОборудования.Записывать = Истина;
	Движение = Движения.МестонахождениеОборудования.Добавить();
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.МестоУстановки = МестоПолучатель;
	Движение.Ответственный = НовыйОтветственный;
	Движение.Количество = 1;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
